Ran Plan for dir: `live` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt run-all plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live": exit status 1: running "terragrunt run-all plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live": 
time=2023-02-19T17:53:28Z level=info msg=The stack at /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live will be processed in the following order for command plan:
Group 1
- Module /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/andromeda/dev/vpc
- Module /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/andromeda/prod/vpc
- Module /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/andromeda/staging/vpc
- Module /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/sandbox/dev.sandbox/vpc

Group 2
- Module /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/andromeda/dev/compute-instance
- Module /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/andromeda/prod/compute-instance
- Module /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/andromeda/staging/compute-instance
- Module /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/sandbox/dev.sandbox/compute-instance



Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.fw_rules will be created
  + resource "google_compute_firewall" "fw_rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTP and SSH"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-prod-andromeda-vpc"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "andromeda-378216"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "webserver",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "prod-andromeda-vpc"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_subnetwork.private_subnet will be created
  + resource "google_compute_subnetwork" "private_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "192.168.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "subnet-prod-andromeda-vpc"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "asia-southeast1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id = (known after apply)
  + vpc_id    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.fw_rules will be created
  + resource "google_compute_firewall" "fw_rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTP and SSH"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-dev-sandbox-vpc"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "sandbox-376723"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "webserver",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "dev-sandbox-vpc"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_subnetwork.private_subnet will be created
  + resource "google_compute_subnetwork" "private_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "192.168.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "subnet-dev-sandbox-vpc"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "asia-southeast2"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id = (known after apply)
  + vpc_id    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.fw_rules will be created
  + resource "google_compute_firewall" "fw_rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTP and SSH"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-dev-andromeda-vpc"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "andromeda-378216"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "webserver",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "dev-andromeda-vpc"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_subnetwork.private_subnet will be created
  + resource "google_compute_subnetwork" "private_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "192.168.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "subnet-dev-andromeda-vpc"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "asia-southeast1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id = (known after apply)
  + vpc_id    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan"
time=2023-02-19T17:53:39Z level=error msg=Module /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/sandbox/dev.sandbox/compute-instance has finished with an error: /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/sandbox/dev.sandbox/vpc/terragrunt.hcl is a dependency of /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/sandbox/dev.sandbox/compute-instance/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block. prefix=[/root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/sandbox/dev.sandbox/compute-instance] 

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.fw_rules will be created
  + resource "google_compute_firewall" "fw_rules" {
      + creation_timestamp = (known after apply)
      + description        = "Creates default firewall rule to allow HTTP and SSH"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "firewall-staging-andromeda-vpc"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "andromeda-378216"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "webserver",
        ]

      + allow {
          + ports    = [
              + "22",
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "staging-andromeda-vpc"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_subnetwork.private_subnet will be created
  + resource "google_compute_subnetwork" "private_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "192.168.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "subnet-staging-andromeda-vpc"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "asia-southeast1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id = (known after apply)
  + vpc_id    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[0] will be created
  + resource "google_compute_instance" "vm_instance" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-medium"
      + metadata                  = {
          + "ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDp8U/vOSmFWxQYyw4DH7ea99gfwhk+8gaz8hm7+cxpf+FPgrGpGJVIyIy7tQLNDzqQOyq+rh42FHLSMekdLUABUeGZb1n6Un443wVQG7qKPbMYA9PniCA/lauXblwy3tQB1CDocwzOmjDdD64robSR7fB8KU7PpZEYzaoapwd++hW6JXeFIsT/RuxdQ2rDez0bA8s76ZpPzlC290SQXD+Bfe+svJ//oYr5YrwL/Z2k/w+KV44m/CpDM+FOJWR+2elA2EUdeKK4ElARAQWW2wJyKLjlDMLtcQvnqxIY7rAMEmkfRpHaWsDpaUSYDTPqxzmBZ1A388OxQ9uWuFBds/3cv2QvA/jCPopFme3Fb/Ho3DWCSjkVIlYEP2e3PNAw88t3ado03o0pMFpzqVKkbVGaYxhgCV5RatE0JDysaIaY+MJEMwGD0lUQFY2GC7R7ZmjHIjAzys81tQKddGX647cMxEJi+x0YNKSAvtIgXjoK5ySvw0RVyLx7etkyUacykBk= ryandito@accelbyte.net@Ryandito-AB-LInux"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "prod-app1"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags                      = [
          + "webserver",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "asia-southeast1-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/sandbox-376723/global/images/image-test"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "DUMMY_VPC_ID"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "DUMMY_SUBNET_ID"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "STANDARD"
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.vm_instance[1] will be created
  + resource "google_compute_instance" "vm_instance" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-medium"
      + metadata                  = {
          + "ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDp8U/vOSmFWxQYyw4DH7ea99gfwhk+8gaz8hm7+cxpf+FPgrGpGJVIyIy7tQLNDzqQOyq+rh42FHLSMekdLUABUeGZb1n6Un443wVQG7qKPbMYA9PniCA/lauXblwy3tQB1CDocwzOmjDdD64robSR7fB8KU7PpZEYzaoapwd++hW6JXeFIsT/RuxdQ2rDez0bA8s76ZpPzlC290SQXD+Bfe+svJ//oYr5YrwL/Z2k/w+KV44m/CpDM+FOJWR+2elA2EUdeKK4ElARAQWW2wJyKLjlDMLtcQvnqxIY7rAMEmkfRpHaWsDpaUSYDTPqxzmBZ1A388OxQ9uWuFBds/3cv2QvA/jCPopFme3Fb/Ho3DWCSjkVIlYEP2e3PNAw88t3ado03o0pMFpzqVKkbVGaYxhgCV5RatE0JDysaIaY+MJEMwGD0lUQFY2GC7R7ZmjHIjAzys81tQKddGX647cMxEJi+x0YNKSAvtIgXjoK5ySvw0RVyLx7etkyUacykBk= ryandito@accelbyte.net@Ryandito-AB-LInux"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "prod-app2"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags                      = [
          + "webserver",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "asia-southeast1-c"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/sandbox-376723/global/images/image-test"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "DUMMY_VPC_ID"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "DUMMY_SUBNET_ID"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "STANDARD"
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_public_ip = [
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[0] will be created
  + resource "google_compute_instance" "vm_instance" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-small"
      + metadata                  = {
          + "ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDp8U/vOSmFWxQYyw4DH7ea99gfwhk+8gaz8hm7+cxpf+FPgrGpGJVIyIy7tQLNDzqQOyq+rh42FHLSMekdLUABUeGZb1n6Un443wVQG7qKPbMYA9PniCA/lauXblwy3tQB1CDocwzOmjDdD64robSR7fB8KU7PpZEYzaoapwd++hW6JXeFIsT/RuxdQ2rDez0bA8s76ZpPzlC290SQXD+Bfe+svJ//oYr5YrwL/Z2k/w+KV44m/CpDM+FOJWR+2elA2EUdeKK4ElARAQWW2wJyKLjlDMLtcQvnqxIY7rAMEmkfRpHaWsDpaUSYDTPqxzmBZ1A388OxQ9uWuFBds/3cv2QvA/jCPopFme3Fb/Ho3DWCSjkVIlYEP2e3PNAw88t3ado03o0pMFpzqVKkbVGaYxhgCV5RatE0JDysaIaY+MJEMwGD0lUQFY2GC7R7ZmjHIjAzys81tQKddGX647cMxEJi+x0YNKSAvtIgXjoK5ySvw0RVyLx7etkyUacykBk= ryandito@accelbyte.net@Ryandito-AB-LInux"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "staging-app"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags                      = [
          + "webserver",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "asia-southeast1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/sandbox-376723/global/images/image-test"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "DUMMY_VPC_ID"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "DUMMY_SUBNET_ID"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "STANDARD"
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_public_ip = [
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.vm_instance[0] will be created
  + resource "google_compute_instance" "vm_instance" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "e2-small"
      + metadata                  = {
          + "ssh-keys" = "admin:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDp8U/vOSmFWxQYyw4DH7ea99gfwhk+8gaz8hm7+cxpf+FPgrGpGJVIyIy7tQLNDzqQOyq+rh42FHLSMekdLUABUeGZb1n6Un443wVQG7qKPbMYA9PniCA/lauXblwy3tQB1CDocwzOmjDdD64robSR7fB8KU7PpZEYzaoapwd++hW6JXeFIsT/RuxdQ2rDez0bA8s76ZpPzlC290SQXD+Bfe+svJ//oYr5YrwL/Z2k/w+KV44m/CpDM+FOJWR+2elA2EUdeKK4ElARAQWW2wJyKLjlDMLtcQvnqxIY7rAMEmkfRpHaWsDpaUSYDTPqxzmBZ1A388OxQ9uWuFBds/3cv2QvA/jCPopFme3Fb/Ho3DWCSjkVIlYEP2e3PNAw88t3ado03o0pMFpzqVKkbVGaYxhgCV5RatE0JDysaIaY+MJEMwGD0lUQFY2GC7R7ZmjHIjAzys81tQKddGX647cMxEJi+x0YNKSAvtIgXjoK5ySvw0RVyLx7etkyUacykBk= ryandito@accelbyte.net@Ryandito-AB-LInux"
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "dev-app"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags                      = [
          + "webserver",
        ]
      + tags_fingerprint          = (known after apply)
      + zone                      = "asia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/sandbox-376723/global/images/image-test"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "DUMMY_VPC_ID"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "DUMMY_SUBNET_ID"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "STANDARD"
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_public_ip = [
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/default.tfplan"
time=2023-02-19T17:53:47Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.
Releasing state lock. This may take a few moments...

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-19T17:53:47Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-19T17:53:47Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-19T17:53:47Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-19T17:53:47Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-19T17:53:47Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-19T17:53:47Z level=info msg=
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "4.53.1"...
- Installing hashicorp/google v4.53.1...
- Installed hashicorp/google v4.53.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-19T17:53:47Z level=error msg=1 error occurred:
	* /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/sandbox/dev.sandbox/vpc/terragrunt.hcl is a dependency of /root/.atlantis/repos/rdnuansa/homelab-studidevops/3/default/live/gcp/sandbox/dev.sandbox/compute-instance/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.


time=2023-02-19T17:53:47Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```
</details>